In [2]:
import pandas as pd

In [9]:
pd.__version__

'0.25.3'

In [13]:
dataframe = pd.read_csv('/home/mauricio/Desktop/original.csv')

In [ ]:
excel =pd.read_excel('/home/mauricio/Desktop/relacion de material.xls',sheet_name='Sheet1')

In [12]:
pd.read_csv?

In [ ]:
excel

In [ ]:
pd.read_excel?

In [4]:
dataframe.head()

,fecha,apertura,alto,bajo,cierre,Adj cierre,volumen
0,1999-12-31,146.843704,147.500000,146.250000,146.8750,104.415031,3172700
1,2000-01-03,148.250000,148.250000,143.875000,145.4375,103.393074,8164300
2,2000-01-04,143.531204,144.062500,139.640594,139.7500,99.349785,8089800
3,2000-01-05,139.937500,141.531204,137.250000,140.0000,99.527527,12177900
4,2000-01-06,139.625000,141.500000,137.750000,137.7500,97.928017,6227200

In [16]:
dataframe.head(10)[['fecha','apertura']]

        fecha    apertura
0  1999-12-31  146.843704
1  2000-01-03  148.250000
2  2000-01-04  143.531204
3  2000-01-05  139.937500
4  2000-01-06  139.625000
5  2000-01-07  140.312500
6  2000-01-10  146.250000
7  2000-01-11  145.812500
8  2000-01-12  144.593704
9  2000-01-13  144.468704

In [17]:
dataframe.tail(10)[['fecha','apertura']]

           fecha    apertura
4620  2018-05-14  273.339996
4621  2018-05-15  271.589996
4622  2018-05-16  271.140015
4623  2018-05-17  271.940002
4624  2018-05-18  271.619995
4625  2018-05-21  273.010010
4626  2018-05-22  273.959991
4627  2018-05-23  271.170013
4628  2018-05-24  272.910004
4629  2018-05-25  272.149994

In [18]:
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4630 entries, 0 to 4629
Data columns (total 7 columns):
fecha         4630 non-null object
apertura      4630 non-null float64
alto          4630 non-null float64
bajo          4630 non-null float64
cierre        4630 non-null float64
Adj cierre    4630 non-null float64
volumen       4630 non-null int64
dtypes: float64(5), int64(1), object(1)
memory usage: 253.3+ KB

In [23]:
dataframe.alto.value_counts() #nos dice cuantas veces se repiten 
                                #valores en la columna alto

144.000000    5
114.839996    5
129.649994    5
133.690002    4
140.889999    4
             ..
119.089996    1
143.234299    1
153.380005    1
131.619995    1
108.199997    1
Name: alto, Length: 3838, dtype: int64

In [24]:
dataframe.alto.value_counts(ascending=True)

108.199997    1
131.619995    1
153.380005    1
143.234299    1
119.089996    1
             ..
140.889999    4
133.690002    4
129.649994    5
114.839996    5
144.000000    5
Name: alto, Length: 3838, dtype: int64

In [28]:
dataframe.alto.sort_values(ascending=False)

4546    286.579987
4547    286.429993
4548    284.739990
4544    284.700012
4545    284.269989
           ...
2309     72.370003
2306     71.730003
2304     71.699997
2307     70.449997
2308     70.000000
Name: alto, Length: 4630, dtype: float64

In [31]:
dataframe[dataframe.alto == 144.000000] #despliega toda la informacion
                                    #del(los) elemento(s) indicado(s)

,fecha,apertura,alto,bajo,cierre,Adj cierre,volumen
24,2000-02-04,143.187500,144.0,142.125000,142.593704,101.371422,4925400
85,2000-05-03,144.000000,144.0,139.781204,140.750000,100.315025,12630700
87,2000-05-05,141.062500,144.0,140.937500,143.531204,102.297218,7862400
104,2000-05-31,142.562500,144.0,142.093704,142.812500,101.785004,6056500
216,2000-11-07,143.140594,144.0,142.562500,143.750000,102.952400,5231300

In [35]:
dataframe[(dataframe.alto == 144.000000) & (dataframe.volumen < 7000000)]
#multimples condiciones dentro del dataframe

,fecha,apertura,alto,bajo,cierre,Adj cierre,volumen
24,2000-02-04,143.187500,144.0,142.125000,142.593704,101.371422,4925400
104,2000-05-31,142.562500,144.0,142.093704,142.812500,101.785004,6056500
216,2000-11-07,143.140594,144.0,142.562500,143.750000,102.952400,5231300

In [8]:
dataframe = pd.read_csv('/home/mauricio/Desktop/originalUTF8.csv')

In [9]:
dataframe

  Nombre y apellido  Edad       País Automovil
0              Juan    35     Mexico        No
1             Pedro    41   Honduras        Si
2             Maria    28       Peru        Si
3             Laura    66  Argentina        No

In [10]:
dataframe[dataframe.País.str.contains('Peru')]

  Nombre y apellido  Edad  País Automovil
2             Maria    28  Peru        Si

In [13]:
dataframe[dataframe.País.str.startswith('H')]

  Nombre y apellido  Edad      País Automovil
1             Pedro    41  Honduras        Si